import re

def get_province(str):
    """ 根据城市获取省份,主要是直辖市和港澳台 """
    area_data = {
        '北京': ['北京市', '朝阳区', '海淀区', '通州区', '房山区', '丰台区', '昌平区', '大兴区', '顺义区', '西城区',
                 '延庆县', '石景山区', '宣武区', '怀柔区', '崇文区', '密云县', '东城区', '门头沟区', '平谷区'],
        '上海': ['上海市', '松江区', '宝山区', '金山区', '嘉定区', '南汇区', '青浦区', '浦东新区', '奉贤区', '闵行区',
                 '徐汇区', '静安区', '黄浦区', '普陀区', '杨浦区', '虹口区', '闸北区', '长宁区', '崇明县', '卢湾区'],
        '天津': ['天津市', '和平区', '北辰区', '河北区', '河西区', '西青区', '津南区', '东丽区', '武清区', '宝坻区',
                 '红桥区', '大港区', '汉沽区', '静海县', '宁河县', '塘沽区', '蓟县', '南开区', '河东区'],
        '重庆': ['重庆市', '江北区', '渝北区', '沙坪坝区', '九龙坡区', '万州区', '永川市', '南岸区', '酉阳县', '北碚区',
                 '涪陵区', '秀山县', '巴南区', '渝中区', '石柱县', '忠县', '合川市', '大渡口区', '开县', '长寿区',
                 '荣昌县', '云阳县', '梁平县', '潼南县', '江津市', '彭水县', '璧山县', '綦江县',
                 '大足县', '黔江区', '巫溪县', '巫山县', '垫江县', '丰都县', '武隆县', '万盛区', '铜梁县', '南川市',
                 '奉节县', '双桥区', '城口县'],
        '台湾': ['台湾省', '台北市', '高雄市', '台中市', '新竹市', '新竹县', '新北市', '桃园市', '基隆市', '台南市', '嘉义市',
                 '宜兰县', '花莲县', '屏东县', '南投县', '台东县', '嘉义县', '苗栗县', '澎湖县'],
        '香港': ["香港", "香港特别行政区"],
        '澳门': ['澳门', '澳门特别行政区']
    }

    for k, v in area_data.items():
        for i in v:
            if str in i:
                return k
    return None

def match_num(str):
    """ 匹配数字 """
    pattern = '\d+'
    num = re.match(pattern, str).group(0)
    return num

def match_url(str):
    """ 匹配url """
    # findall() 查找匹配正则表达式的字符串
    url = re.findall(r'http[s]?://(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\(\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+', str)
    return url[0]

def match_date(str):
    """ 匹配日期 """
    pattern = r'(\d{4}-\d{1,2}-\d{1,2})'
    date = re.match(pattern, str).group(0)
    return date
